using Microsoft.AspNetCore.Mvc;
using Municipality.Models;

namespace Municipality.Controllers
{
    public class NewsController : Controller
    {
        public IActionResult Index()
        {
            return View();
        }

        public IActionResult Detail(int id)
        {
            IList<Article> articles = new List<Article>();

            Article a1 = new Article();
            a1.Id = 1;
            a1.Image = "/images/9.jpg";
            a1.Title = "Кампания Екоучилище";
            a1.Description= "<p class=\"fs-5 mb-4\">Екопак България и Община Пещера организират кампания „Екоучилище“, за обучение и мотивиране на учениците за разделното събиране и последващо рециклиране. Кампанията ще бъде с начало 30.03.2022г. и ще продължи 1 месец, до 30.04.2022г. включително. Ще се проведе в училищата на територията на Община Пещера.</p><p class=\"fs-5 mb-4\">Кампанията включва два задължителни компонента – образователен (провеждане на уроци по темата за разделното събиране и рециклиране) и състезателен (състезание между училищата в събиране на рециклируеми пластмасови бутилки и алуминиеви кенчета).</p><p class=\"fs-5 mb-4\">Кампанията има за цел да информира и мотивира учениците и техните семейства да събират разделно и да предават за последващо рециклиране пластмасови и алуминиеви отпадъци и така да помогнат за чистотата на природата и града, в който живеят.</p><p class=\"fs-5 mb-4\">В нея ще бъдат обхванати всички деца от І до ХІІ клас от училищата в Община Пещера.</p>";

            Article a2 = new Article();
            a2.Id = 2;
            a2.Image = "/images/11.jpg";
            a2.Title = "В Пещера прерязаха лентата на обновената ул. „Петър Раков“";
            a2.Description = "<p class=\"fs-5 mb-4\">Изцяло ремонтираната улица, свъзрваща кв. „Луковица“ с града, бе официално открита с церемония в началото на пещерския квартал. По време на встъпителните думи стана ясно, че 2 500 000 лв. от държавния бюджет през 2020 г. са били заделени за реконструкция и ремонт на републикански път, както и за обновяване на ул. „Петър Раков“. С тържествен водосвет отслужен от свещеника на храм „Света Петка“ бе поставено началото на церемонията.</p>";

            Article a3 = new Article();
            a3.Id = 3;
            a3.Image = "/images/12.jpg";
            a3.Title = "Тийнейджър се опита да подкупи с евро и левове полицаи в Пещера";
            a3.Description = "<p class=\"fs-5 mb-4\">Непълнолетен е задържан при опит да подкупи полицаи от РУ-Пещера. Случката се разиграла в петък късно вечерта на една от улиците в родопския град. Автопатрул при полицейското управление в Пещера спрял за проверка лек автомобил „Фолксваген“.</ p>";

            Article a4 = new Article();
            a4.Id = 4;
            a4.Image = "/images/10.jpg";
            a4.Title = "Златни медали за певци и танцьори от New Art Center Пещера";
            a4.Description = "<p class=\"fs-5 mb-4\">В Елин Пелин се проведе Фолклорен фестивал „Лазарица“, от който децата на New Art Center Peshtera се завърнаха със златни медали.</p>";

            articles.Add(a1);
            articles.Add(a2);
            articles.Add(a3);
            articles.Add(a4);

            var foundArticle = articles.Where(a => a.Id == id).FirstOrDefault(new Article());

            return View(foundArticle);
        }


    }
}
